In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(np.random.randint(1,101,20).reshape(5,4), np.arange(10,60,10),['A','B','C','D'])

In [3]:
df

     A   B   C   D
10   7  94  65  88
20  83  16  65  50
30  18  75  43  15
40  54  29  79  46
50   2  71  94   1

In [5]:
df[df['A']<30]

     A   B   C   D
10   7  94  65  88
30  18  75  43  15
50   2  71  94   1

In [7]:
df[(df['A']<50) | (df['B']<40)]

     A   B   C   D
10   7  94  65  88
20  83  16  65  50
30  18  75  43  15
40  54  29  79  46
50   2  71  94   1

In [12]:
df[(df['C']>20) & (df['D']<70)][{'A','B'}]

     B   A
20  16  83
30  75  18
40  29  54
50  71   2